title: Command Shell Execution Detection
id: 7c5b6d4a-1111-2222-3333-123456789002
status: experimental
description: Detect Windows Command Shell execution.
author: Agata Gabara
date: 2025/06/14
logsource:
product: windows
category: process_creation

detection:
selection:
Image|endswith: '\cmd.exe'
condition: selection

level: medium

tags:

* attack.execution
* attack.t1059.003
