title: Failed Logons Detection
id: 7c5b6d4a-1111-2222-3333-123456789004
status: experimental
description: Detect failed Windows authentication attempts.
author: Agata Gabara
date: 2025/06/14
logsource:
  product: windows
  service: security

detection:
  selection:
    EventID: 4625
  condition: selection

level: medium

tags:
  - attack.credential-access
  - attack.t1110