title: Privileged Logons Detection
id: 7c5b6d4a-1111-2222-3333-123456789005
status: experimental
description: Detect logons with special privileges assigned.
author: Agata Gabara
date: 2025/06/14
logsource:
  product: windows
  service: security

detection:
  selection:
    EventID: 4672
  condition: selection

level: medium

tags:
  - attack.defense-evasion
  - attack.privilege-escalation
  - attack.t1078